In [6]:
import pandas as pd
import numpy as np

In [19]:
customers = pd.read_csv("customers.csv")
orders = pd.read_csv("orders.csv")
order_items = pd.read_csv("order_items.csv")

In [13]:
orders.sort_values("order_date").head()

     order_id  customer_id  order_date
246      5247         1017  2024-01-01
56       5057         1019  2024-01-01
188      5189         1072  2024-01-01
430      5431         1006  2024-01-01
13       5014         1090  2024-01-01

In [14]:
customers.sort_values("last_name").head()

     customer_id first_name last_name      city
31          1032       Noah     Brown        LA
112         1113      Maria     Brown       NYC
97          1098        Zoe      Chen        LA
53          1054        Zoe     Davis  New York
32          1033       alex     Davis   chicago

In [15]:
customers.iloc[4,:]

customer_id        1005
first_name        Priya
last_name      Anderson
city                 LA
Name: 4, dtype: object

In [17]:
ny_customers = customers[customers["city"].str.lower().isin(["new york","nyc"])]
ny_customers.head()

    customer_id first_name last_name      city
0          1001       Evan     Smith  New York
3          1004      Aisha     Smith  new york
5          1006       Evan     Patel  new york
7          1008      Maria     Smith       NYC
10         1011        Ben     Davis  New York

In [18]:
import os
print(os.getcwd())

c:\Users\madhu\Launchcode\DataAnalysisProjects\data-analysis-projects\data-manipulation\exercises

In [20]:
recent_orders=orders[orders["order_date"] > "2024-02-14"]
recent_orders.head()

    order_id  customer_id  order_date
1       5002         1045  2024-02-20
5       5006         1031  2024-03-10
7       5008         1061  2024-03-08
9       5010         1054  2024-03-24
12      5013         1074  2024-02-16

In [23]:
order_items[order_items['quantity'] >=2].sort_values("quantity")

     order_id product_name  quantity  unit_price
870      5450      Monitor         2         300
26       5199      Monitor         2         300
22       5047        Mouse         2          25
17       5143      Monitor         2         300
16       5268    USB Cable         2          10
..        ...          ...       ...         ...
54       5108       Laptop         3        1200
42       5215    Desk Lamp         3          45
40       5328      Monitor         3         300
32       5391        Mouse         3          25
31       5250      Monitor         3         300

[464 rows x 4 columns]

In [24]:
customers["first_name"] = customers["first_name"].str.strip().str.capitalize()
customers["last_name"] = customers["last_name"].str.strip().str.capitalize()

In [25]:
customers.sort_values("last_name")

     customer_id first_name last_name         city
12          1013      Priya  Anderson           LA
113         1114      Maria  Anderson           LA
81          1082     Jordan  Anderson      chicago
109         1110      Maria  Anderson           LA
4           1005      Priya  Anderson           LA
..           ...        ...       ...          ...
68          1069     Taylor    Wilson          NYC
71          1072     Taylor    Wilson           LA
95          1096        Zoe    Wilson  Los Angeles
40          1041       Evan    Wilson  Los Angeles
59          1060     Jordan    Wilson          NYC

[120 rows x 4 columns]

In [27]:
customers["city"].value_counts()

city
LA             24
New York       22
chicago        17
Los Angeles    17
new york       15
NYC            15
Chicago        10
Name: count, dtype: int64

In [28]:
city_standardization_mapping = {'LA': 'Los Angeles', 'NYC': 'New York'}

In [35]:
customers["city"] = customers["city"].replace(city_standardization_mapping)

In [37]:
customers["city"] =customers["city"].str.title()

AttributeError: Can only use .str accessor with string values!

#Using.apply()

In [39]:
customers["clean_last_name"] = customers["last_name"].apply(
    lambda last_name:
    last_name.strip()
)

In [40]:
customers["clean_last_name"].value_counts()

clean_last_name
Davis       19
Smith       18
Patel       17
Brown       16
Chen        16
Anderson    13
Wilson      13
Lopez        8
Name: count, dtype: int64

In [41]:
order_items["total_price"] = order_items["quantity"] * order_items["unit_price"]

In [42]:
order_items["total_price_apply"] = order_items.apply(
    lambda row:
    row["quantity"] * row["unit_price"], axis = 1
)

In [43]:
order_items

,order_id,product_name,quantity,unit_price,total_price,total_price_apply
0,5311,Monitor,3,300,900,900
1,5303,Keyboard,3,70,210,210
2,5012,Keyboard,3,70,210,210
3,5318,Monitor,3,300,900,900
4,5080,USB Cable,1,10,10,10
...,...,...,...,...,...,...
895,5303,USB Cable,2,10,20,20
896,5117,Monitor,2,300,600,600
897,5124,Keyboard,1,70,70,70
898,5399,USB Cable,2,10,20,20
899,5281,Monitor,1,300,300,300

In [44]:
order_items["order_items"] = order_items.apply(
    lambda row :(
        "Large Expensive Order" if row["quantity"] >= 3 and row["unit_price"] >50
        else "bulk order" if row["quantity"] >=3
        else "standard order"
    ), axis = 1
)

In [45]:
order_items

,order_id,product_name,quantity,unit_price,total_price,total_price_apply,order_items
0,5311,Monitor,3,300,900,900,Large Expensive Order
1,5303,Keyboard,3,70,210,210,Large Expensive Order
2,5012,Keyboard,3,70,210,210,Large Expensive Order
3,5318,Monitor,3,300,900,900,Large Expensive Order
4,5080,USB Cable,1,10,10,10,standard order
...,...,...,...,...,...,...,...
895,5303,USB Cable,2,10,20,20,standard order
896,5117,Monitor,2,300,600,600,standard order
897,5124,Keyboard,1,70,70,70,standard order
898,5399,USB Cable,2,10,20,20,standard order
899,5281,Monitor,1,300,300,300,standard order

#Merging tables

In [47]:
orders_with_customers = orders.merge(customers,how = "inner")
orders_with_customers.head()

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name
0,5001,1089,2024-01-26,Aisha,Smith,NaN,Smith
1,5002,1045,2024-02-20,Priya,Davis,NaN,Davis
2,5003,1004,2024-02-14,Aisha,Smith,NaN,Smith
3,5004,1036,2024-02-13,Chloe,Davis,NaN,Davis
4,5005,1070,2024-01-05,Jordan,Brown,NaN,Brown

In [49]:
orders_customers_items = orders_with_customers.merge(order_items, on = "order_id", how ="inner")

In [50]:
orders_customers_items.head()

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name,product_name,quantity,unit_price,total_price,total_price_apply,order_items
0,5001,1089,2024-01-26,Aisha,Smith,NaN,Smith,Monitor,1,300,300,300,standard order
1,5001,1089,2024-01-26,Aisha,Smith,NaN,Smith,Desk Lamp,2,45,90,90,standard order
2,5001,1089,2024-01-26,Aisha,Smith,NaN,Smith,Desk Lamp,1,45,45,45,standard order
3,5002,1045,2024-02-20,Priya,Davis,NaN,Davis,Monitor,2,300,600,600,standard order
4,5002,1045,2024-02-20,Priya,Davis,NaN,Davis,Monitor,2,300,600,600,standard order

Grouping and aggregation

In [51]:
order_items["total_price"].sum()

np.int64(420615)

In [55]:
order_items.groupby("product_name")["total_price"].sum().sort_values(ascending=False)

product_name
Laptop       296400
Monitor       90000
Keyboard      14140
Desk Lamp     10755
Mouse          6750
USB Cable      2570
Name: total_price, dtype: int64

In [58]:
order_items.groupby("product_name")["quantity"].sum().sort_values(ascending= False)

product_name
Monitor      300
Mouse        270
USB Cable    257
Laptop       247
Desk Lamp    239
Keyboard     202
Name: quantity, dtype: int64

In [59]:
order_items.groupby("product_name").agg(
    total_revenue= ("total_price", "sum"),
    avg_quantity= ("quantity" ,"mean")
)

              total_revenue  avg_quantity
product_name
Desk Lamp             10755      1.593333
Keyboard              14140      1.578125
Laptop               296400      1.776978
Monitor               90000      1.754386
Mouse                  6750      1.719745
USB Cable              2570      1.658065

In [61]:
combined = orders.merge(order_items, on="order_id") \
                 .merge(customers, on="customer_id")
combined.groupby("customer_id")["total_price"].sum().sort_values(ascending=False).head()

customer_id
1008    13625
1057    13330
1087    11170
1061    10645
1070     9945
Name: total_price, dtype: int64

Reshaping data

In [63]:
sample= combined[["customer_id","product_name","total_price"]].head(12)

In [65]:

pivot = sample.pivot_table(index="customer_id", columns = "product_name",

                            values="total_price", aggfunc="sum")

In [66]:
pivot.reset_index().melt(
    id_vars = "customer_id",
    var_name="product",
     value_name="revenue"
)

    customer_id    product  revenue
0          1004  Desk Lamp    135.0
1          1036  Desk Lamp      NaN
2          1045  Desk Lamp      NaN
3          1089  Desk Lamp    135.0
4          1004   Keyboard    140.0
5          1036   Keyboard      NaN
6          1045   Keyboard      NaN
7          1089   Keyboard      NaN
8          1004     Laptop   2400.0
9          1036     Laptop      NaN
10         1045     Laptop      NaN
11         1089     Laptop      NaN
12         1004    Monitor      NaN
13         1036    Monitor      NaN
14         1045    Monitor   1200.0
15         1089    Monitor    300.0
16         1004      Mouse      NaN
17         1036      Mouse     50.0
18         1045      Mouse      NaN
19         1089      Mouse      NaN
20         1004  USB Cable     20.0
21         1036  USB Cable     20.0
22         1045  USB Cable      NaN
23         1089  USB Cable      NaN

In [70]:
combined.query("quantity >= 2") \
    .groupby("city") \
    .agg(total_revenue=("total_price", "sum")) \
    .sort_values("total_revenue", ascending=False)

Empty DataFrame
Columns: [total_revenue]
Index: []